tsung/SP-Tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <!-- <server host="siddarth.phtsmfeyep.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server> -->
    <server host="localhost" port="3000" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="4" duration="30" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="5" duration="30" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>

    <!--
    <arrivalphase phase="6" duration="30" unit="second">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="7" duration="30" unit="second">
      <users arrivalrate="64" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="8" duration="30" unit="second">
      <users arrivalrate="128" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="9" duration="30" unit="second">
      <users arrivalrate="256" unit="second"></users>
    </arrivalphase>
    -->

  </load>

  <options>
    <option name="global_ack_timeout" value="4000"></option>
  </options>

  <sessions>
    <session name="View Company" probability="20" type="ts_http">
      <setdynvars sourcetype="random_number" start="1" end="4">
        <var name="company_id" />
      </setdynvars>

      <transaction name="companies">
        <request>
          <http url='/companies'></http>
        </request>
      </transaction>

      <transaction name="view_company">
        <request subst="true">
          <http url='/companies/%%_company_id%%'></http>
        </request>
      </transaction>
    </session>


    <session name="Create User" probability="20" type="ts_http">
      <transaction name="users_index">
        <request>
          <http url='/users'></http>
        </request>
      </transaction>

      <transaction name="new_user">
        <request>
          <dyn_variable name="authenticity_token"/>
          <http url='/users/new'></http>
        </request>
      </transaction>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
        <var name="authenticity_token"/>
      </setdynvars>

      <thinktime random="true" value="4"/>

      <setdynvars sourcetype="random_string" length="5">
        <var name="rndstring" />
      </setdynvars>

      <transaction name="create_user">
        <request subst="true">
          <dyn_variable name="user_id" re="Location: http://.*/users/(.*)\r"/>
          <http url='/users' method='POST' contents="authenticity_token=%%_authenticity_token%%&amp;user%5Bname%5D=User %%_rndstring%%"></http>
        </request>
      </transaction>

      <transaction name="view_user">
        <request subst="true">
          <http url='/users/%%_user_id%%'></http>
        </request>
      </transaction>
    </session>


    <session name="View User Info" probability="20" type="ts_http">
      <setdynvars sourcetype="random_number" start="1" end="4">
        <var name="user_id" />
      </setdynvars>

      <transaction name="view_user">
        <request subst="true">
          <http url='/users/%%_user_id%%'></http>
        </request>
      </transaction>

      <transaction name="view_trades">
        <request subst="true">
          <http url='/users/%%_user_id%%/trades'></http>
        </request>
      </transaction>
    </session>


    <session name="Make Deposit" probability="20" type="ts_http">
      <setdynvars sourcetype="random_number" start="1" end="4">
        <var name="user_id" />
      </setdynvars>

      <setdynvars sourcetype="random_number" start="-100" end="100">
        <var name="amount" />
      </setdynvars>

      <transaction name="new_deposit">
        <request subst="true">
          <dyn_variable name="authenticity_token"/>
          <http url='/users/%%_user_id%%/deposits/new'></http>
        </request>
      </transaction>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
        <var name="authenticity_token"/>
      </setdynvars>

      <transaction name="create_deposit">
        <request subst="true">
          <http url='/users/%%_user_id%%/deposits' method='POST' contents="authenticity_token=%%_authenticity_token%%&amp;deposit%5Bamount%5D=%%amount%%"></http>
        </request>
      </transaction>

      <transaction name="deposits">
        <request subst="true">
          <http url='/users/%%_user_id%%/deposits'></http>
        </request>
      </transaction>
    </session>


    <session name="Place Order" probability="20" type="ts_http">
      <setdynvars sourcetype="random_number" start="1" end="4">
        <var name="user_id" />
      </setdynvars>

      <setdynvars sourcetype="random_number" start="1" end="4">
        <var name="company_id" />
      </setdynvars>

      <setdynvars sourcetype="random_number" start="100" end="200">
        <var name="price" />
      </setdynvars>

      <setdynvars sourcetype="random_number" start="1" end="2">
        <var name="type" />
      </setdynvars>

      <transaction name="new_order">
        <request subst="true">
          <dyn_variable name="authenticity_token"/>
          <http url='/users/%%_user_id%%/orders/new'></http>
        </request>
      </transaction>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
        <var name="authenticity_token"/>
      </setdynvars>

      <transaction name="create_order">
        <request subst="true">
          <http url='/users/%%_user_id%%/order' method='POST' contents="authenticity_token=%%_authenticity_token%%&amp;order%5Bprice%5D=%%_price%%&amp;order%5Bcompany_id%5D=%%_company_id%%&amp;order%5Border_type%5D=%%_type%%"></http>
        </request>
      </transaction>

      <transaction name="orders">
        <request subst="true">
          <http url='/users/%%_user_id%%/orders'></http>
        </request>
      </transaction>
    </session>
  </sessions>
</tsung>